Revit 2026 API

# FailureMessageAccessorGetDescriptionText Method

---

Retrieves the description of the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetDescriptionText()
```
```vb
Public Function GetDescriptionText As String
```
```cpp
public:
String^ GetDescriptionText()
```
```fsharp
member GetDescriptionText : unit -> string
```

#### Return Value

String The description text.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

#### Reference

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace